Revit 2018 API
VertexStreamPositionNormal.AddVertices Method
 Inserts vertices into the stream and associated buffer.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2017
Syntax
C#
public void AddVertices(
	IList<VertexPositionNormal> vertices
)
Visual Basic
Public Sub AddVertices ( _
	vertices As IList(Of VertexPositionNormal) _
)
Visual C++
public:
void AddVertices(
	IList<VertexPositionNormal^>^ vertices
)
Parameters
vertices
Type: System.Collections.Generic.IList<VertexPositionNormal>
 The vertices to be inserted.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was NULL
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown if the associated buffer is not mapped. -or- Thrown if the associated buffer has insufficient space.
See Also
VertexStreamPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace